In [87]:
import pandas as pd

In [88]:
people={
    "first": ["Corey" , "Dobby" , "john"],
    "last" : ["Schafer" , "Jane" , "deo"],
    "email":["core@gmail.com" , "dobby@gmail.com" , "johnDeo@gmail.com"]
}

In [89]:
df = pd.DataFrame(people)

In [90]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   john      deo  johnDeo@gmail.com

In [91]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

# If we want to change all the column names

In [92]:
df.columns = ['first_name' , 'last_name' ,'email']

In [93]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [94]:
df

  first_name last_name              email
0      Corey   Schafer     core@gmail.com
1      Dobby      Jane    dobby@gmail.com
2       john       deo  johnDeo@gmail.com

# If we want to change something specific

In [95]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME              EMAIL
0      Corey   Schafer     core@gmail.com
1      Dobby      Jane    dobby@gmail.com
2       john       deo  johnDeo@gmail.com

In [96]:
df.columns = df.columns.str.replace('_','!')
df

  FIRST!NAME LAST!NAME              EMAIL
0      Corey   Schafer     core@gmail.com
1      Dobby      Jane    dobby@gmail.com
2       john       deo  johnDeo@gmail.com

In [97]:
df.columns = df.columns.str.replace('!','_')
df

  FIRST_NAME LAST_NAME              EMAIL
0      Corey   Schafer     core@gmail.com
1      Dobby      Jane    dobby@gmail.com
2       john       deo  johnDeo@gmail.com

In [98]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name              email
0      Corey   Schafer     core@gmail.com
1      Dobby      Jane    dobby@gmail.com
2       john       deo  johnDeo@gmail.com

In [99]:
df.rename(columns={'first_name': 'first' , 'last_name':'last'})

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   john      deo  johnDeo@gmail.com

In [100]:
df

  first_name last_name              email
0      Corey   Schafer     core@gmail.com
1      Dobby      Jane    dobby@gmail.com
2       john       deo  johnDeo@gmail.com

In [101]:
df.rename(columns={'first_name': 'first' , 'last_name':'last'}, inplace=True)

In [102]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   john      deo  johnDeo@gmail.com

In [103]:
# Updating the data in our row
df.loc[2]

first                 john
last                   deo
email    johnDeo@gmail.com
Name: 2, dtype: object

In [104]:
df.loc[2] = ['John' , 'Smith' , 'JohnSmith@gmail.com']
df

   first     last                email
0  Corey  Schafer       core@gmail.com
1  Dobby     Jane      dobby@gmail.com
2   John    Smith  JohnSmith@gmail.com

In [105]:
df.loc[2 , ['last' ,'email']] = [ 'Doe' , 'JohnDoe@gmail.com']
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John      Doe  JohnDoe@gmail.com

In [106]:
df.loc[2 , 'last'] = 'Smith'

In [107]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John    Smith  JohnDoe@gmail.com

In [108]:
df.at[2 , 'last'] = 'Doe'
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John      Doe  JohnDoe@gmail.com

In [109]:
filt = (df['email'] == 'JohnDoe@gmail.com')
df[filt]['last'] = 'Smith'

C:\Users\GAURI SINGHAL\AppData\Local\Temp\ipykernel_29496\3747058160.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [110]:
df['email'] = df['email'].str.lower()

In [111]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John      Doe  johndoe@gmail.com

In [112]:
df['email'].apply(len)

0    14
1    15
2    17
Name: email, dtype: int64

In [113]:
def update_email(email):
    return email.upper()

In [114]:
df['email'].apply(update_email)

0       CORE@GMAIL.COM
1      DOBBY@GMAIL.COM
2    JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [115]:
df['email'] = df['email'].apply(update_email)

In [116]:
df

   first     last              email
0  Corey  Schafer     CORE@GMAIL.COM
1  Dobby     Jane    DOBBY@GMAIL.COM
2   John      Doe  JOHNDOE@GMAIL.COM

In [117]:
df['email'] = df['email'].apply(lambda x:x.lower())

In [118]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John      Doe  johndoe@gmail.com

In [119]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [120]:
df.apply(len , axis='columns')

0    3
1    3
2    3
dtype: int64

In [121]:
# If we want to grab the minimum value from the colunns
df.apply(pd.Series.min)

first             Corey
last                Doe
email    core@gmail.com
dtype: object

In [122]:
df.apply(lambda x: x.min())

first             Corey
last                Doe
email    core@gmail.com
dtype: object

In [123]:
# Map is used to access all the values of dataframe . We can change in all the columns of the data 
# applymap is only use for dataframe 
df.applymap(len)

C:\Users\GAURI SINGHAL\AppData\Local\Temp\ipykernel_29496\2459950430.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     7     14
1      5     4     15
2      4     3     17

In [124]:
df.applymap(str.lower)

C:\Users\GAURI SINGHAL\AppData\Local\Temp\ipykernel_29496\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

   first     last              email
0  corey  schafer     core@gmail.com
1  dobby     jane    dobby@gmail.com
2   john      doe  johndoe@gmail.com

In [125]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John      Doe  johndoe@gmail.com

In [ ]:
# apply is only used for series 
df['first'].map({'Corey':'Chris' , 'John':'Mary'})
# Here if we will assign the above to df['first'] then NaN will also com so if we want to change the specific then we can use replace emthod

0    Chris
1      NaN
2     Mary
Name: first, dtype: object

In [127]:
df

   first     last              email
0  Corey  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   John      Doe  johndoe@gmail.com

In [130]:
df['first'] = df['first'].replace({'Corey':'Chris' , 'John':'Mary'})

In [131]:
df

   first     last              email
0  Chris  Schafer     core@gmail.com
1  Dobby     Jane    dobby@gmail.com
2   Mary      Doe  johndoe@gmail.com